seges:  dw      0xB800
; ------------------------------------------------------------------------------
; Базовая система ввода-вывода для быстрого доступа
; ------------------------------------------------------------------------------

; Очистка экрана в AX
cls:    mov     es, [cs:seges]
        xor     di, di
        mov     cx, 2048
        rep     stosw
        ret

; ------------------------------------------------------------------------------
; Установка точки 8x8 пикселей (AL) на экране 80x25 символов, BH-Y, BL-X
; ------------------------------------------------------------------------------
cpset:  ret
