// Регистры выбора источника памяти
// ---------------------------------------------------------------------
reg         cp;             // =0 CS:IP | =1 SEG:EA
reg         over;           // Сегментный префикс
reg [ 1:0]  rep;            // Префикс REP:
reg [15:0]  rep_ip;         // Начало инструкции до префиксов
reg [15:0]  seg;            // SEG:EA Эффективный адрес
reg [19:0]  ea;
reg [15:0]  wb;             // Запись в MODRM, стек, память и т.д.
reg         dir;            // =0 REG/MEM, REG :: =1 REG, REG/MEM
reg         size;           // =0 8bit :: =1 16bit
reg         skip;           // =1 Не читать операнды ModRM

// Объявление регистров
// ---------------------------------------------------------------------
reg [15:0]  ax = 16'h1234, bx = 16'h0050, cx = 16'hFFFF, dx = 16'h0000,
            sp = 16'h0000, bp = 16'h0001, si = 16'h0003, di = 16'h0001,
            es = 16'h0120, cs = 16'hFFFF, ss = 16'h0001, ds = 16'h0000;
reg [15:0]  ip = 16'h0000;
//                      ODIT SZ A  P C
reg [11:0]  flags = 12'b0000_0000_0011;

// Регистры исполнения
// ---------------------------------------------------------------------
reg [ 3:0]  t, m, a, next;
reg [ 7:0]  opcode, modrm;

// АЛУ
// ---------------------------------------------------------------------
reg [ 2:0]  alu;
reg [15:0]  op1, op2;
