; ------------------------------------------------------------------------------
;       ПОЛУБИОС: ПОЛУПОКЕР ОНЛИНЭ
; ------------------------------------------------------------------------------

maxsize equ     1024

        org     0
begin:  mov     ax, $B800
        mov     es, ax
        mov     ax, cs
        mov     ds, ax
        xor     ax, ax
        mov     ss, ax
        mov     sp, $1000

        mov     si, s
        mov     di, 0
        mov     ah, $17
@@:     lodsb
        and     al, al
        je      $
        stosw
        jmp     @b

s       db      "Hello world!",0

; ------------------------------------------------------------------------------
;       ТУПЕЙШАЯ РЕАЛИЗАЦИЯ НЕИЗВЕСТНО ЧЕГО ВООБЩЕ
; ------------------------------------------------------------------------------

        times   ((maxsize - 16) - $) db 0
        jmp     (0x10000 - maxsize/16) : begin
        times   (maxsize-$) db 0xFF
