
        ; BIOS FF000-FFFFFh
        org     100h

        cld
        cli

        ; Инициализация сегментов
        mov     sp, $0100
        xor     ax, ax
        mov     ds, ax
        mov     ss, ax
        mov     ax, $A000
        mov     es, ax

        mov     dx, $03D8
        mov     al, 4
        out     dx, al

        xor     di, di
        mov     cx, 32768
        mov     ax, $3333
        rep     stosw
        hlt

        mov     dl, 0
.c:     mov     al, dl
        mov     di, 32
        mov     ch, 200
.b:     mov     cl, 0
.a:     stosb
        inc     ax
        dec     cl
        jne     .a
        add     di, 320-256
        inc     al
        dec     ch
        jne     .b
        inc     dl
        jmp     .c
        hlt

; ------------------------------------------------------------------------------
; Видеосервис
; ------------------------------------------------------------------------------
int10h:
        iret

; ------------------------------------------------------------------------------
; Клавиатура и таймер
; ------------------------------------------------------------------------------
int08h:
int09h:
int16h:
        iret

; ------------------------------------------------------------------------------
; Дисковая подсистема
; ------------------------------------------------------------------------------
int13h:
        iret
