
        org     0
        xor     ax, ax              ; Активация
        mov     es, ax
        mov     ds, ax
        mov     ss, ax
        mov     sp, $0800           ; 2K стековая высота
        mov     ah, $07
        call    CLS
        hlt

; Очистка экрана; AH-параметры цвета
; ------------------------------------------------------------------------------
CLS:    push    es
        push    $B800
        pop     es
        mov     [cs:CONF.clr], ah
        mov     al, 0
        xor     di, di
        mov     cx, 2000
        rep     stosw
        pop     es
        ret

; Параметры и конфигурации
; ------------------------------------------------------------------------------
CONF:
.clr:   db      0                   ; Текущий цвет символов

; ------------------------------------------------------------------------------
times   (4096-16-$) db 0
        jmp     $FF00 : $0000
times   11      db 0
